{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/akirasato/Documents/Okamuro_Seminar/Okamuro_seminar_2020/jr_project/csv/for_analysis/stataoutput.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Oct 2020, 20:50:17
{txt}
{com}. 
. * import csv file
. import delimited foreign_raw.csv
{res}{text}(7 vars, 5,076 obs)

{com}. 
. * create new dummy varables for quarters
. gen q2 = 0
{txt}
{com}. gen q3 = 0
{txt}
{com}. gen q4 = 0
{txt}
{com}. 
. replace q2 = 1 if quarter == 2
{txt}(1,128 real changes made)

{com}. replace q3 = 1 if quarter == 3
{txt}(1,128 real changes made)

{com}. replace q4 = 1 if quarter == 4
{txt}(1,128 real changes made)

{com}. 
. * creater a new dummy variable for cashless-point refund project
. gen project = 0
{txt}
{com}. replace project = 1 if quarter == 4 & year == 2019
{txt}(564 real changes made)

{com}. replace project = 1 if quarter == 1 & year == 2020
{txt}(564 real changes made)

{com}. 
. * create a new variable for time index
. gen time_id = 0
{txt}
{com}. replace time_id = 1 if quarter == 2 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 2 if quarter == 3 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 3 if quarter == 4 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 4 if quarter == 1 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 5 if quarter == 2 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 6 if quarter == 3 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 7 if quarter == 4 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 8 if quarter == 1 & year == 2020
{txt}(564 real changes made)

{com}. 
. * create a new variable for prefecture id
. egen pref_id = group(pref)
{txt}
{com}. 
. 
. * commanted command below
. /*
> save main
> */
. * ########################### CREATION OF THE MAIN DATASET END ########################### *
. 
. 
. /*
> ANALYSIS 1: without quarter dummy, until 2019 4Q (table 1 & 2)
> ANALYSIS 2: without quarter dummy, until 2020 1Q (table 3 & 4)
> ANALYSIS 3: with quarter dummy, until 2019 4Q (table 5 & 6)
> ANALYSIS 4: with quarter dummy, until 2020 1Q (table 7 & 8)
> */
. 
. 
. * ########################### ANALYSIS 1 START ########################### *
. clear all 
{res}{txt}
{com}. use main
{txt}
{com}. 
{txt}end of do-file

{com}. 