{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/akirasato/Documents/Okamuro_Seminar/Okamuro_seminar_2020/jr_project/csv/for_analysis/stataoutput.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Oct 2020, 16:46:04
{txt}
{com}. 
. * import csv file
. import delimited foreign_raw.csv
{res}{text}(7 vars, 5,076 obs)

{com}. 
. * create new dummy varables for quarters
. gen q2 = 0
{txt}
{com}. gen q3 = 0
{txt}
{com}. gen q4 = 0
{txt}
{com}. 
. replace q2 = 1 if quarter == 2
{txt}(1,128 real changes made)

{com}. replace q3 = 1 if quarter == 3
{txt}(1,128 real changes made)

{com}. replace q4 = 1 if quarter == 4
{txt}(1,128 real changes made)

{com}. 
. * creater a new dummy variable for cashless-point refund project
. gen project = 0
{txt}
{com}. replace project = 1 if quarter == 4 & year == 2019
{txt}(564 real changes made)

{com}. replace project = 1 if quarter == 1 & year == 2020
{txt}(564 real changes made)

{com}. 
. * create a new variable for time index
. gen time_id = 0
{txt}
{com}. replace time_id = 1 if quarter == 2 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 2 if quarter == 3 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 3 if quarter == 4 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 4 if quarter == 1 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 5 if quarter == 2 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 6 if quarter == 3 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 7 if quarter == 4 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 8 if quarter == 1 & year == 2020
{txt}(564 real changes made)

{com}. 
. * create a new variable for prefecture id
. egen pref_id = group(pref)
{txt}
{com}. 
. 
. * commanted command below
. /*
> save main
> */
. * ########################### CREATION OF THE MAIN DATASET END ########################### *
. 
. 
. /*
> ANALYSIS 1: without quarter dummy, until 2019 4Q (table 1 & 2)
> ANALYSIS 2: without quarter dummy, until 2020 1Q (table 3 & 4)
> ANALYSIS 3: with quarter dummy, until 2019 4Q (table 5 & 6)
> ANALYSIS 4: with quarter dummy, until 2020 1Q (table 7 & 8)
> */
. 
. 
. * ########################### ANALYSIS 1 START ########################### *
. clear all 
{res}{txt}
{com}. use main
{txt}
{com}. outreg2 using stat0.tex, replace sum(log)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}v1 {c |}{res}      5,076      2537.5    1465.459          0       5075
{txt}{space 8}year {c |}{res}      5,076    2018.667    .6667323       2018       2020
{txt}{space 5}quarter {c |}{res}      5,076    2.333333    1.154814          1          4
{txt}{space 5}answers {c |}{res}      5,076    259.9007    703.0267          0       7595
{txt}{space 1}consumption {c |}{res}      5,076    38615.62     68296.1          0   632303.8
{txt}{hline 13}{c +}{hline 57}
{space 10}q2 {c |}{res}      5,076    .2222222    .4157807          0          1
{txt}{space 10}q3 {c |}{res}      5,076    .2222222    .4157807          0          1
{txt}{space 10}q4 {c |}{res}      5,076    .2222222    .4157807          0          1
{txt}{space 5}project {c |}{res}      5,076    .2222222    .4157807          0          1
{txt}{space 5}time_id {c |}{res}      5,076           4    2.582243          0          8
{txt}{hline 13}{c +}{hline 57}
{space 5}pref_id {c |}{res}      5,076          24      13.566          1         47

Following variable is string, not included:  
pref  item  
{txt}{stata `"shellout using `"stat0.tex"'"':stat0.tex}
{browse `"/Users/akirasato/Documents/Okamuro_Seminar/Okamuro_seminar_2020/jr_project/csv/for_analysis"' :dir}{com} : {txt}{stata `"seeout using "stat0.txt""':seeout}

{com}. 
{txt}end of do-file

{com}. exit
