{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/akirasato/Documents/Okamuro_Seminar/Okamuro_seminar_2020/jr_project/csv/for_analysis/stataoutput.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Sep 2020, 13:26:34
{txt}
{com}. 
. * import csv file
. import delimited foreign_raw.csv
{res}{text}(7 vars, 5,076 obs)

{com}. 
. * create new dummy varables for quarters
. gen q2 = 0
{txt}
{com}. gen q3 = 0
{txt}
{com}. gen q4 = 0
{txt}
{com}. 
. replace q2 = 1 if quarter == 2
{txt}(1,128 real changes made)

{com}. replace q3 = 1 if quarter == 3
{txt}(1,128 real changes made)

{com}. replace q4 = 1 if quarter == 4
{txt}(1,128 real changes made)

{com}. 
. * creater a new dummy variable for cashless-point refund project
. gen project = 0
{txt}
{com}. replace project = 1 if quarter == 4 & year == 2019
{txt}(564 real changes made)

{com}. replace project = 1 if quarter == 1 & year == 2020
{txt}(564 real changes made)

{com}. 
. * create a new variable for time index
. gen time_id = 0
{txt}
{com}. replace time_id = 1 if quarter == 2 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 2 if quarter == 3 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 3 if quarter == 4 & year == 2018
{txt}(564 real changes made)

{com}. replace time_id = 4 if quarter == 1 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 5 if quarter == 2 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 6 if quarter == 3 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 7 if quarter == 4 & year == 2019
{txt}(564 real changes made)

{com}. replace time_id = 8 if quarter == 1 & year == 2020
{txt}(564 real changes made)

{com}. 
. * create a new variable for prefecture id
. egen pref_id = group(pref)
{txt}
{com}. 
. 
. * commanted command below
. save main
{txt}file main.dta saved

{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. clear all 
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. use main
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. keep if item == "Group Package"
{txt}(4,653 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. * set the dataset as a panel data
. xtset pref_id time_id
{res}{txt}{col 8}panel variable:  {res}pref_id (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}time_id, 0 to 8
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. xtdescribe

 {txt}pref_id:  {res}1{txt}, {res}2{txt}, ..., {res}47                                     {txt}n ={res}         47
 {txt}time_id:  {res}0, 1, ..., 8                                      {txt}T ={res}          9
           {txt}Delta(time_id) = {res}1 unit
           {txt}Span(time_id)  = {res}9 periods
           {txt}(pref_id*time_id uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     9       9       9         9         9       9       9

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 9}
{res}       47    100.00  100.00{txt} {c |}  {res}111111111
{txt} {hline 27}{c +}{c -}{c -}{hline 9}
{res}       47    100.00        {txt} {c |}  {res}XXXXXXXXX
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. xtreg consumption project, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       423
{txt}Group variable: {res}pref_id{txt}{col 49}Number of groups{col 67}={col 69}{res}        47

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0082{col 63}{txt}min{col 67}={col 69}{res}         9
{txt}     between = {res}     .{col 63}{txt}avg{col 67}={col 69}{res}       9.0
{txt}     overall = {res}0.0031{col 63}{txt}max{col 67}={col 69}{res}         9

{txt}{col 49}F({res}1{txt},{res}375{txt}){col 67}={col 70}{res}     3.09
{txt}corr(u_i, Xb){col 16}= {res}-0.0000{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0798

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} consumption{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}project {c |}{col 14}{res}{space 2} 6606.307{col 26}{space 2}  3760.35{col 37}{space 1}    1.76{col 46}{space 3}0.080{col 54}{space 4}-787.7072{col 67}{space 3} 14000.32
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 142118.4{col 26}{space 2} 1772.646{col 37}{space 1}   80.17{col 46}{space 3}0.000{col 54}{space 4} 138632.8{col 67}{space 3} 145603.9
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 39492.599
     {txt}sigma_e {c |} {res} 32152.886
         {txt}rho {c |} {res} .60138089{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}46{txt}, {res}375{txt}) = {res}13.58{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. xtreg consumption project, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       423
{txt}Group variable: {res}pref_id{txt}{col 49}Number of groups{col 67}={col 69}{res}        47

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0082{col 63}{txt}min{col 67}={col 69}{res}         9
{txt}     between = {res}     .{col 63}{txt}avg{col 67}={col 69}{res}       9.0
{txt}     overall = {res}0.0031{col 63}{txt}max{col 67}={col 69}{res}         9

{txt}{col 49}F({res}1{txt},{res}375{txt}){col 67}={col 70}{res}     3.09
{txt}corr(u_i, Xb){col 16}= {res}-0.0000{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0798

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} consumption{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}project {c |}{col 14}{res}{space 2} 6606.307{col 26}{space 2}  3760.35{col 37}{space 1}    1.76{col 46}{space 3}0.080{col 54}{space 4}-787.7072{col 67}{space 3} 14000.32
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 142118.4{col 26}{space 2} 1772.646{col 37}{space 1}   80.17{col 46}{space 3}0.000{col 54}{space 4} 138632.8{col 67}{space 3} 145603.9
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 39492.599
     {txt}sigma_e {c |} {res} 32152.886
         {txt}rho {c |} {res} .60138089{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}46{txt}, {res}375{txt}) = {res}13.58{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. 
{txt}end of do-file

{com}. use main
{err}no; dataset in memory has changed since last saved
{txt}{search r(4), local:r(4);}

{com}. clear all
{res}
{com}. use main

. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD02878.000000"
{txt}
{com}. clear all
{res}{txt}
{com}. use main
{txt}
{com}. keep if item == "Group Package"
{txt}(4,653 observations deleted)

{com}. xtset pref_id time_id
{res}{txt}{col 8}panel variable:  {res}pref_id (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}time_id, 0 to 8
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtreg consumption project q2 q3 q4, fe vce(cluster pref_id)
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       423
{txt}Group variable: {res}pref_id{txt}{col 49}Number of groups{col 67}={col 69}{res}        47

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1559{col 63}{txt}min{col 67}={col 69}{res}         9
{txt}     between = {res}     .{col 63}{txt}avg{col 67}={col 69}{res}       9.0
{txt}     overall = {res}0.0588{col 63}{txt}max{col 67}={col 69}{res}         9

{txt}{col 49}F({res}4{txt},{res}46{txt}){col 67}={col 70}{res}     7.32
{txt}corr(u_i, Xb){col 16}= {res}-0.0000{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0001

{txt}{ralign 78:(Std. Err. adjusted for {res:47} clusters in pref_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} consumption{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}project {c |}{col 14}{res}{space 2} 8152.879{col 26}{space 2} 4439.335{col 37}{space 1}    1.84{col 46}{space 3}0.073{col 54}{space 4}-783.0379{col 67}{space 3}  17088.8
{txt}{space 10}q2 {c |}{col 14}{res}{space 2} 27345.94{col 26}{space 2}  5165.38{col 37}{space 1}    5.29{col 46}{space 3}0.000{col 54}{space 4} 16948.57{col 67}{space 3} 37743.31
{txt}{space 10}q3 {c |}{col 14}{res}{space 2} 9496.844{col 26}{space 2} 3046.968{col 37}{space 1}    3.12{col 46}{space 3}0.003{col 54}{space 4} 3363.616{col 67}{space 3} 15630.07
{txt}{space 10}q4 {c |}{col 14}{res}{space 2} 25143.82{col 26}{space 2} 5299.412{col 37}{space 1}    4.74{col 46}{space 3}0.000{col 54}{space 4} 14476.66{col 67}{space 3} 35810.99
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 127999.9{col 26}{space 2} 2988.101{col 37}{space 1}   42.84{col 46}{space 3}0.000{col 54}{space 4} 121985.1{col 67}{space 3} 134014.6
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 39492.599
     {txt}sigma_e {c |} {res} 29780.383
         {txt}rho {c |} {res} .63749931{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
{txt}end of do-file

{com}. 